{"about-us": ["Technical education in India contributes a major share to the overall education system and plays a vital role in the social and economic development of our nation.", "In accordance with the provisions of the AICTE Act (1987), for the first five years after its inception in 1988, the Minister for Human Resource Development, the Government of India, was the Chairman of the Council. The first full-time Chairman was appointed on July 2, 1993 and the Council was reconstituted in March 1994 with a term of three years. The Executive Committee was re-constituted on July 7, 1994 and All India Board of Studies and Advisory Boards were constituted in 1994-95. Regional Offices of the Ministry of Human Resource Development, the Government of India, located in Kolkata, Chennai, Kanpur, and Mumbai were transferred to AICTE and the staff working in these offices were also deputed to the Council on foreign service terms w.e.f. October 1, 1995.", "These offices functioned as secretariats of regional Committees in the four regions (North, East, West and South). Three new regional Committees in southwest, central, and northwest regions with their secretariats located in Bangalore, Bhopal, and Chandigarh, respectively, were also established on July 27, 1994. One more regional committee in South-Central region with its Secretariat in Hyderabad was notified on March 8, 2007.", "A true facilitator and an objective regulator;", "Transparent governance and accountable approach towards the society;", "Planned and coordinated development of Technical Education in the country by ensuring world-class standards of institutions through accreditation;", "Emphasis on developing high quality institutions, academic excellence, and innovative research and development programmes;", "Networking with/ or a network of institutions for optimum resource utilization;", "Dissemination of knowledge;", "Technology forecasting and global manpower planning;", "Promoting industry-institution interaction for developing new products, services, and patents;", "Inculcating entrepreneurship;", "Encouraging indigenous technology;", "Focusing on non-formal education;", "Providing affordable education to all;", "Making Technical Education in India globally acceptable;", "\nThe following are the Bureaus and Cells within AICTE to facilitate its smooth functioning:\n", "\n", "The beginning of formal technical education in India can be dated back to the mid-19th century. Major policy initiatives in the pre-independence period included the appointment of the Indian Universities Commission in 1902, issue of the Indian Education Policy Resolution in 1904, and the Governor General’s policy statement of 1913 stressing the importance of technical education, the establishment of IISc in Bangalore, Institute for Sugar, Textile & Leather Technology in Kanpur, N.C.E. in Bengal in 1905, and industrial schools in several provinces.", "All India Council for Technical Education (AICTE) was set up in November 1945 as a national-level apex advisory body to conduct a survey on the facilities available for technical education and to promote development in the country in a coordinated and integrated manner. And to ensure the same, as stipulated in the National Policy of Education (1986), AICTE was vested with:\n•\tStatutory authority for planning, formulation, and maintenance of norms & standards\n•\tQuality assurance through accreditation\n•\tFunding in priority areas, monitoring, and evaluation\n•\tMaintaining parity of certification & awards\n•\tThe management of technical education in the country \n", "Constitution of the Technical Education Committee of the Central Advisory Board of Education (CABE)", "Preparation of the Sergeant Report ", "Formation of the All India Council for Technical Education (AICTE)", "", "The Government of India (the Ministry of Human Resource Development) also constituted a National Working Group to look into the role of AICTE in the context of proliferation of technical institutions, maintenance of standards, and other related matters. The Working Group recommended that AICTE be vested with the necessary statutory authority for making it more effective, which would consequently require restructuring and strengthening with the necessary infrastructure and operating mechanisms.", "(No 52 of 1987 as passed by both the Houses of Parliament)", "The AICTE Act was constituted to provide for the establishment of an All India Council for Technical Education with a view to proper planning and co-ordinated development of a technical education system throughout the country, the promotion of qualitative improvements of such education in relation to planned quantitative growth, and regulation & proper maintenance of norms and standards in the technical education system and for the matters connected therewith.\n\n", "Download the ActThe purview of AICTE (the Council) covers programmes of technical education including training and research in Engineering, Technology, Architecture, Town Planning, Management, Pharmacy, Applied Arts and Crafts, Hotel Management and Catering Technology etc. at different levels. ", "Meet the individuals who bring unique perspectives, broad experience acquired through close collaborations, and deep insight to our work.", "The hierarchical arrangement of the lines of authority, communications, rights and duties of AICTE. ", "A repository of key messages from notable personalities and dignitaries.", "The transformation of Indian education dates back to it being the pioneer in the 800 BCs where the undivided India had global institutions, whereas the deterioration began with the ages of modernization and industrialization.", "Details of Officers and Officials at AICTE Regional and Camp Offices.", "Nelson Mandela Marg\nVasant Kunj, New Delhi-110070\nPhone: 011-26131576-78,80, 29581000", " ", "AICTE - Northern Regional Office\nGovernment Polytechnic Campus \nAdjoining Directorate of Tech. Education Office,\nVikas Nagar, Zoo Road, Kanpur-208024  ", "Ph.0512-2585012,2585014,2585018, Helpline: 2581263, Fax No. 2585012, Email: nro@aicte-india.org", "Plot No.1, 5th floor, DTE, Punjab Building,\nSector 36-A, Chandigarh-160036. ", "Ph. 0172-2613326, 2661201\nFax No. 2660179 Email: nwro@aicte-india.org", "L.B. Block, Sector-III, College of leather Technology,\nCampus, Salt Lake City, Kolkata-700091 ", "Ph. 9433654767\nEmail: ero@aicte-india.org", "Assam Engineering College Campus, \nJalukbari, Guwahati Assam - 781013 ", "Ph. 6026178870\nFax No. 2570104 Email: coguwahati@aicte-india.org", "2nd floor, Industrial Research Building, National Institute of Industrial Engineering (NITIE) Campus, \nVihar Lake, Mumbai-400087", "Ph. 022-28475793, 28470019\nFax: 22851551 Email: wro@aicte-india.org", "College of Engineering Campus, Thiruvananthapuram,\n\nKerala-695016", "Ph. 0471-2596363, 2594343, 2592323 Email: aicte.tvpm@aicte-india.org", "South Western Regional Office, P.K. Block,Palace Road, Bangalore – 560 009", "Ph. 080-22205979, 080-22205919, 080-22208407\nFax No. 080-22253232 Email: swro@aicte-india.org", "West Block Nos. 201-204 & 221 to 224, 2nd Floor\nSwarna Jayanti Commercial Complex\nAmeerpet, Hyderabad 500038", "Ph. 040-23340113, 040-23345071\nEmail: scro@aicte-india.org", "Shastri Bhawan, 26\nHaddows Road, Chennai-600006", "Ph. 044-28279998, 28275650, 28232754, Fax No. 28255863 Email: sro@aicte-india.org", "Airport Bypass Road, Gandhi Nagar, \nBhopal-462036 ", "Ph.: 0755-2744313-16 Fax.: 0755-2744316Email: cro@aicte-india.org", "All India Council For Technical Education\nA-1-2, Quarters,Chameli Baug,\n Campus of M.S.University Baroda, \nVadodara- 39002 (Gujarat) ", "Ph.: 0265-2750648, 2750614 Email: croco@aicte-india.org"], "news": ["Read the latest news and press releases ", "", "AICTE’s Indian Knowledge Systems receives an overwhelming response for its research project", "", "", "AICTE to tie-up with Khadi and Village Industries Commission (KVIC)", "", "", "Registration Open for Vidyanjali Higher Education Volunteer Programme", "", "", "Distribution of 12 lakh NEAT free coupons by Education Minister Shri Dharmendra Pradhan Ji", "", "AICTE’s Indian Knowledge Systems receives an overwhelming response for its research project", "AICTE to tie-up with Khadi and Village Industries Commission (KVIC)", "Registration Open for Vidyanjali Higher Education Volunteer Programme", "Distribution of 12 lakh NEAT free coupons by Education Minister Shri Dharmendra Pradhan Ji", "Distribution of 12 lakh Ed-Tech free coupons to Socially and", "Press Release of NEAT Cell for 12 lakh NEAT free seats", "Centralized Support System for stakeholders launched by AICTE", "AICTE’s three-week Faculty Development Programme on Indian Knowledge System (IKS)", "Press Release on the theme of 'Improving Ease of Doing Business", "Technical Education Minister Dr Subhash Garg interacts with AICTE Pragati scholarship winners", "Republic Day Celebration 26th January 2022", "Launch of SWAYAM Online Course \"Linear to Circular Economy\"", "Takniki Padhaya Pustak Puraskar Samaroh", "Vishvakarma Awards held on 05.09.2021", "Hon'ble Prime Minister Interaction with Winner of Toyacthon-2021", "Lilavati Award held on 11.04.2021", "ASLAP Book Release", "Global Teacher Award 2020", "Enjoy the videos from the world of AICTE ", "Hon’ble President of India, Hon’ble Shri Pranab Mukherjee attended the launch of SWAYAM, 32 SWAYAM Prabha DTH Channels and National Academic Depository at the National Convention on Digital Initiat", "All India Council for Technical Education (AICTE), Ministry of Human Resource Development, Govt.", "Shri Prakash Javadekar, hon'ble Union Minister of Human Resources, introduces Smart India Hackathon 2017.", " ", " "], "bureaus": ["The organization structure of the AICTE comprises of the following bureaus", "The Approvals Bureau processes proposals for grant of approval for establishing a new technical institution or an integrated campus.", "Special Cell for Research & Coordination with State Govt./UTs. and others coordinates and integrates development of technical education.", "The Administration Bureau nominates AICTE representatives on various bodies and committees, along with providing logistic support for conducting meetings and trainings for all the staff of the Council.", "The Finance Bureau owns drawing and disbursement of planned and non-planned accounts, along with the management of cash and bills.", "As defined in the AICTE act 1987, Technical Education means programmes of Education, Research, and training in Engineering and Technology, Architecture, Town Planning, Management, Pharmacy, and Applied Arts and Crafts, and such other programmes or areas as the Central Government may in consultation with the Council, by notification in the official gazette declare. ", "Planning and framing of policies related to Academics for strengthening and improving quality of Technical Education", "Administration consists of the performance or management of business operations and thus the making or implementing of major decisions. Administration can be defined as the universal process of organizing people and resources efficiently so as to direct activities toward common goals and objectives.", "Finance Bureau has been mandated to manage Finances (Funds) efficiently and effectively in such a manner as to accomplish the objectives of the organization by planning, monitoring, organizing, and controlling of the monetary resources of an organization. ", "The organization structure of the AICTE comprises of the following bureaus", "The Approvals Bureau processes proposals for grant of approval for establishing a new technical institution or an integrated campus.", "Special Cell for Research & Coordination with State Govt./UTs. and others coordinates and integrates development of technical education.", "The Administration Bureau nominates AICTE representatives on various bodies and committees, along with providing logistic support for conducting meetings and trainings for all the staff of the Council.", "The Finance Bureau owns drawing and disbursement of planned and non-planned accounts, along with the management of cash and bills."], "Initiatives": ["The AICTE-SLA project is designed to measure the benchmark levels and gains in academic and aptitude skills by the students in technical programs and to understand the various factors that affect skill development of students in Technical Institutes across India.", "The scheme “Jal Shakti Abhiyan” with the theme, “Sanchay Jal Behtar Kal”, has commenced from 1st July 2019 ", "Hon’ble HRD Minister Dr. Ramesh Pokhriyal “Nishank” launched a campaign “One Student One Tree” on 20th July. This initiative is in line with the Hon’ble Prime Minister’s idea of a green and healthy environment", "UK India Education Research Initiative (UKIERI) was started in April 2006 with the aim of enhancing educational links between India and the United Kingdom.", "AICTE PARAKH Portal is OPEN for Registration and Assessments", "Applications invited for AICTE-UKIERI Technical Education Leadership Development Programme AY 2020-21", "From addressing underemployment among engineering graduates to handing them degrees only on completion of four months of internship.", "Engineering colleges not maintaining the prescribed student-faculty ratio will be liable for action, the All India Council for Technical Education (AICTE) has said.", "Read More", "Republic Day Celebration 26th January 2022", "Launch of SWAYAM Online Course \"Linear to Circular Economy\"", "Takniki Padhaya Pustak Puraskar Samaroh", "Vishvakarma Awards held on 05.09.2021", "Hon'ble Prime Minister Interaction with Winner of Toyacthon-2021", "Read More", "Smart India Hackathon is a nationwide initiative to provide students a platform to solve some of pressing problems we face in our daily lives, and thus inculcate a culture of product innovation and a mindset of problem solving.", "The last edition of the hackathon saw over 5 million+ students from various engineering colleges compete for the top prize at 35+ locations.", "In SIH, the students would also have the opportunity to work on challenges faced within the private sector organisations and create world class solutions for some of the top companies in the world, thus helping the Private sector hire the best minds from across the nation.\n", " Click Here for Invitation to Private & Public Sector industries and NGOs to join Smart India Hackathon (SIH) ", " For more details please visit https://sih.gov.in/ ", "Met Bhujbal Knowledge City Institute of Engineering, Nagpur, Maharashtra", "NPTEL seamlessly helping students and teachers to improve their knowledge with quality educational content. NPTEL imparted sanctity in education by offering education to all without the geographical barriers.", "Met Bhujbal Knowledge City Institute of Engineering, Nagpur, Maharashtra", "NPTEL seamlessly helping students and teachers to improve their knowledge with quality educational content. NPTEL imparted sanctity in education by offering education to all without the geographical barriers.", "QUEST, Bangalore", "I am a Director at QUEST, in Bangalore and at 53+, am thrilled at my \"academic\" performance. Truly, the grey-cells are still active! I have a Bachelors degree in Electronics(RVCE-Bangalore) and a Masters in Telecommunications and Software Engineering from BITS, Pilani. I have worked on Alcatel, Motorola and Cisco projects as a senior Project Manager.\nThis is turning out to be an amazing learning experience for me at 53+ ! \nI have 15 NPTEL Certifications,as on date. I have a passion for life-long learning !", "Met Bhujbal Knowledge City Institute of Engineering, Nagpur, Maharashtra", "NPTEL seamlessly helping students and teachers to improve their knowledge with quality educational content. NPTEL imparted sanctity in education by offering education to all without the geographical barriers.", "QUEST, Bangalore", "I am a Director at QUEST, in Bangalore and at 53+, am thrilled at my \"academic\" performance. Truly, the grey-cells are still active! I have a Bachelors degree in Electronics(RVCE-Bangalore) and a Masters in Telecommunications and Software Engineering from BITS, Pilani. I have worked on Alcatel, Motorola and Cisco projects as a senior Project Manager.\nThis is turning out to be an amazing learning experience for me at 53+ ! \nI have 15 NPTEL Certifications,as on date. I have a passion for life-long learning !", "Integrated Test Range,  DRDO, Balasore, Odisha", "First of all, I would like to thank all the coordinating instituions of NPTEL for creating such a wonderful platform. It gave me an opportunity to learn the subjects across disciplines. It was like sitting in the classroom of the professor of best institutions in the world. They delivered their research experience within the short period. This has paved the way for the digital era in India.  Last but not the least,  NPTEL has enlightened my life.\"", "Indian Oil Corporation Limited", "Yes! NPTEL lectures are good for GATE preparation.\nThe Good Points: Lectures made by senior IIT professors,Concept explanation is good,Detailed explanation,You can watch the same lecture again in case of doubt,You will find everything that might be asked in GATE.", "Please choose the SWAYAM National Coordinator for support.* :", "All India Council for Technical Education (AICTE) was set-up in November 1945 as a national level Apex Advisory Body to conduct survey on the facilities on technical education and to promote development in the country in a coordinated and integrated manner. To ensure the same, as stipulated in, the National Policy of Education (1986), AICTE is vested with statutory authority for planning, formulation and maintenance of norms and standards, quality assurance through accreditation, funding in priority areas, monitoring and evaluation, maintaining parity of certification and awards and ensuring coordinated and integrated development and management of technical education in the country.", "The purview of AICTE (the Council) covers coordinated planning and development and regulation of programmes of technical education including training and research in Engineering, \nTechnology, Architecture, Town Planning, Management, Pharmacy, Applied Arts and Crafts, Hotel Management and Catering Technology etc. at different levels.", "The Confederation of Indian Industry (CII) works to create and sustain an environment conducive to the development of India, partnering industry, Government, and civil society, through advisory and consultative processes.\nCII is a non-government, not-for-profit, industry-led and industry-managed organization, playing a proactive role in India's development process. Founded over 118 years ago, India's premier business association has over 7100 members, from the private as well as public sectors, including SMEs and MNCs, and an indirect membership of over 90,000 enterprises from around 257 national and regional sectoral industry bodies.", "The CII Theme for 2013-14 is Accelerating Economic Growth through Innovation, Transformation, Inclusion and Governance. Towards this, CII advocacy will accord top priority to stepping up the growth trajectory of the nation, while retaining a strong focus on accountability, transparency and measurement in both corporate and social eco-system, building a knowledge economy, and broad-basing development to help deliver the fruits of progress to many.", "AICTE and CII through their collaboration are striving to bring together the academia and the Industry together for the overall benefit of technical education and all its stakeholders.", " Click here to visit The Confederation of Indian Industry (CII) website", "The award aims to seek engagement with all stakeholders, primarily the student community to draw their attention towards immense scope and potential that the Technology offers for abstract objectives such as cleanliness, sustainability, environment etc. The rising use of technologies especially IOT, robotics, cloud and automation have immense potential to re-model a campus in to a smart campus. These smart campuses can minimally help in ‘forward delivery’ by optimizing the use of, inter alia energy and water consumption in the campus. Smart campuses would construct ‘Smart Citizens’ – those who are ‘future-ready’ for the Smart Cities and an even Smarter India.\n", "Clean and Smart Campus is also expected to facilitate dialogue and sharing of ideas amongst students, faculty and administrators towards the United Nations Sustainable Development Goals", "AICTE’s Student Start-up Policy launched by Shri Pranab Mukherjee,  the then Hon’ble President of India on 16th November 2016, is designed in accordance with \"Start-up India\" Action plan, Govt. of India to guide and promote student driven innovations & start-ups in more than 10,000 AICTE approved institutions across the country. ", "Visit the website: www.startup.aicte-india.org", "Soon to be world's largest youth population and with 3rd ranking in the global start-up ecosystem index, India has the potential and is on the track of becoming the global powerhouse of innovation and entrepreneurship activities in the world. With a dynamic growth in the number of start-ups in the country, corresponding numbers of stakeholders like, investors, incubators, mentors, accelerators, etc. have been added to the thriving ecosystem and is helping India transform into a knowledge-driven economy. But we have significant amount of challenges which we have to navigate through in order to realise our true potential.\n", "AICTE’s Start-up policy has incorporated various initiatives focused on overall student development to strengthen the entrepreneurship ecosystem by promoting strong inter-institutional partnerships among technical institutions, other ecosystem enablers, different stakeholders, programs, market and society.", "AICTE Start-up Policy Implementation Unit has initiated many concentrated efforts\ntowards policy and program convergences and ecosystem streamlining in association\nwith various leading national and international ecosystem enablers at multiple level. ", "All India Council for Technical Education (AICTE), Ministry of Human Resource Development, Govt. of India holding a competition “AICTE-Vishwakarma Awards-2020” for the students and institutes of AICTE approved institutions.", "AIM:To encourage and motivate young students and institutions to raise their performance in their specific domains leading to significant contribution towards the growth and development of the nation as a whole. ", "OBJECTIVE:To recognize and honour the innovative work of the students displaying exceptional skills in different categories. ", "AICTE Internships help INDIAN STUDENTS find internships they love and ORGANIZATIONS find best Interns on PAN India basis .", "1 Crore Internship By 2025 | 1189,950+ Internships | 38000+ Companies ", "Come for the skill, stay for the experience.", " Your vision, our mission", "Explore our categories", "Find the one suited for you today!", "Made with ♥ in India | From Students to Students \n                 @Copyright 2020 AICTE "], "schemes": ["Learn more about the various student and Faculty development by AICTE", "Explore various, schemes and special scholarship run by AICTE to promote technical education", "Learn about the various Faculty development schemes and programmes.", "Read more about the institutional development schemes run by AICTE", "Learn about the schemes that promote research in technical education in India", "Learn about schemes that promote co-ordinated development in India.", "Last date for online applications under AICTE AQIS-Hostel for SC/ST Students Scheme u", "With some states opposing introduction of National Eligibility Test (NET) for admission to engineering courses, it is unlikely to be held next year but could become a reality in 2019-'20, a top AIC", "The All India Council for Technical Education (AICTE) is all set to release the provision of a model exam format to technical education institutes for testing the conceptual knowledge of children.", "Engineering colleges not maintaining the prescribed student-faculty ratio will be liable for action, the All India Council for Technical Education (AICTE) has said.", "Explore various, schemes and special scholarship run by AICTE to promote technical education", "Scheme to foster cross-border partnerships focussed on creating a platform that opens the path for collaborative research between Canada and India to a wider pool of student talent in India.", "AICTE has approved 'AICTE – SWANATH SCHOLARSHIP SCHEME' for children from any one of the following categories:\n           1. Orphan \n           2. Either or both parents died due to Covid-19 \n           3. Wards of Armed Forces and Central Paramilitary Forces martyred in action (Shaheed) \n            to provide them financial support of Rs. 50,000/- per annum for every year of study.\n    ", "AICTE Scheme for study tour of ATAL TUNNEL, Himachal Pradesh– YOUTH UNDERTAKING VISIT FOR ACQUIRING KNOWLEDGE (YUVAK)", "AICTE intends to seek applications for AICTEs LILAVATI AWARD-2021-22 based on the theme “Women Empowerment” from the eligible teams of AICTE approved institutions, who have undertaken remarkable intervention for the cause and made an impact that showcases their work under eight different sub-themes.", "Scholarship is awarded to full time GATE/GPAT qualified students admitted to M.E./ M. Tech/ M. Arch and M.Pharma courses in AICTE approved Institutions/Colleges @Rs. 12,400/- PM/ student.", "Admitting full time meritorious research scholars by providing research fellowship who wants to seek admission to Ph.D. in AICTE approved Technical Institutes/University Departments for carrying out research in thrust areas", "Scholarship/Contingency is awarded to meritorious girls taking admission in AICTE approved Technical institution at Degree/ Diploma. Total 10000 scholarship are given @ Rs 50000 as incidentals each year.", "Scholarship/Contingency is awarded  to  Differently  abled students taking admission in AICTE approved Technical institution at Degree/ Diploma. Scholarship given @ Rs 50000 as incidentals each year. ", "The objective of the scheme is to provide travel assistance registration fees to a team of minimum 2 to 10 students for attending competition at international level in order to encourage engineering students to improve their field of technical education.", "Objective of the Scheme is to build up capacities in youth of J&K, educate, enable and empowering them to compete in normal course, enhancing and boosting employment potentials in students of J&K. Total 5000 scholarship are given @ Rs. 100000/- as Maintenance Charges and academic fee as Rs. 30000/- to General Degree, Rs. 125000/- to Engineering Degree & Rs. 300000/- to Medical Degree each year.", "An “AICTE-INAE Travel Grant Scheme” for Engineering Students to present papers abroad has been launched for enhancing the quality of engineering education in the country. ", "A unique initiative to identify new and disruptive digital solutions for solving the challenges faced by our country under the program of Smart India Hackathon 2017. This event was held on 1st – 2nd April 2017 for 36 hrs non-stop competition. 9544 technology students, 598 problems statements, 29 different central govt. ministries, 26 different Nodal centres & funding of Rs. 3 Lakh per team for 100 qualified teams.", "The main objective of the scheme is to nurture an innovation ecosystem that benefits the technologically deficient MSMEs and technical institutes both. 408 Small and Medium Enterprises have given requirement of 738 Technology students.", "Learn about the various Faculty development schemes and programmes.", "General Guidelines Applicable to all Faculty Development Schemes of AICTE.", "STTP-SFURTI intends to conduct faculty and student trainings through financial assistance from AICTE to enable faculty members and students in the field of technical education to introspect and learn techniques that can help prepare faculty and students to impart there research work in the development of small-scale business for the nation.", "In order to train the Inductee Teachers in AICTE approved / recognised institutions, National Initiative for Technical Teachers Training (for Inductee Teachers) has been launched. It imparts training to the Inductee Teachers in three phases. The first phase of the training programme for the Inductee Teachers shall be conducted in Massive Open Online Courses (MOOCs) mode for eight modules on the SWAYAM platform through the NITTT portal www.nittt.ac.in followed by one-month industrial internship (second phase) and then mentor based training (third phase).", "This scheme is aimed to recognize the meritorious faculties on Teachers Day i.e. 5th September every year at National level and encourage them to update themselves to the ever changing needs of higher education at global level and thereby becoming an effective contributor towards the society.", "The main objective of the programme is to upgrade the qualification of the faculty members of the degree and polytechnic level institutions in the country. Financial assistance  @Rs. 15000/-PM and Rs. 5000/ PM are given to Ph.D/ M.Tech Scholars. Presently 114 QIP centers are operational throughout the country.", "This scheme Promotes Research in identified thrust areas of in Technical Education. RPS is aimed to create research ambience in the institutes by promoting research in engineering sciences and innovations in established and newer technologies; and to generate Master’s and Doctoral degree candidates to augment the quality of faculty and research. The limit of funding is Rs 25 Lakh for project duration of 3 years.", " Scheme provides scholarships to the faculty who fulfils eligibility criteria and obtains admission in the Doctoral Degree programme leading to award of PhD degree in any of the enlisted top 500 universities/institutes (based on the QS ranking, the Times ranking and the Shanghai ranking) in the world.", "The scheme is intended to Institutions   for   induction training to   teachers employed in AICTE approved Technical Institutions to facilitate up-gradation of knowledge and skill. Rs 5-7 Lakh are granted for the 2 weeks FDP.", "Short Term Training Program (STTP) intends to conduct faculty trainings through financial assistance from AICTE to enable faculty members in the field of technical education to introspect and learn techniques that can help prepare students for active and successful participants in a knowledge society. ", "To Develop the skill of the participants to involve the masses in traditional sports/games and fun games for physical activity through recreation.", "The objective of the AICTE – University training programs is to conduct training for faculty members to prepare them for being successful in a knowledge society.", "The objective, of AICTE – Technical University Training program for Librarians, is to conduct training for Librarians to prepare them for being successful and affective in a knowledge society. \nIt provide a dynamic and quality user centered library and information services that enhance teaching, learning and research while inculcating life-long learning skills and fostering human development.\n", "The scheme enables meritorious faculty to interact at International Level Conferences, both within and outside India, Seminars, and Symposia.", "AICTE and INAE distinguished visiting Professor scheme envisages promotion of industry-institute interaction.", "The objective is to conduct AICTE-ISTE Induction/ Refresher Programmes for the teaching faculty working in technical institutions. Total 100 Refresher programme & 50 Orientation programme with the funding of Rs. 300000 per programme.", "To promote use of 'Scheduled Regional Language' in Technical Education for creating knowledge base in local language and to encourage creation of treasure of latest technical knowledge incorporating the newest developments by grant of financial support to the distinguished faculty/writers/translators.", "The Emeritus Professor (Distinguished Practicing Engineer) Fellowship intends to utilize the expertise of\nhighly qualified and experienced superannuated Engineers who have made undoubtable,\nunchallengeable, unparalleled and exceptional contribution to the society in their respective fields in\nany discipline in engineering for the benefit of students/faculty of host institutes & of institutes located\nin the adjoining areas.", "AICTE’s Leadership in Teaching Excellence (LITE) is a national programme aims to bring modern software engineering knowledge through proven online teaching-learning methods to 100,000 teachers and 2.4 Crore students in India.", "Examinations play a very important role in deciding the quality of education.This policy attempts to bring out recommendations for reforms in examination system to meet challenges of emerging engineering education landscape.Further to complete the policy for the purposes of implementation, AICTE is presently in the process of compiling the question banks as applicable to various disciplines in the field of Engineering.", "360 Degree Feedback is aimed at benefitting the Faculty members, Students of institutes recognized by AICTE in which faculty members are subjected to feedback by management, administrative staff, HODs, students & the society to include (stake holders) on different parameters. 360 Degree Feedback app and a portal has been designed for the institutes, teachers and students. This activity has been made mandatory for the purposes of promotion to all the faculties in AICTE approved institution the AICTE Gazette dated 01 March 2019 and will be a mandatory part for qualification in AICTE - AQIS (financially funded schemes) as also for AICTE Visvesvaraya Best Teachers’ Award.", "AICTE-Student Learning Assessment (PARAKH) is to evaluate technical students of India and to assess their overall qualitative and quantitative growth during the course of study in order to get a suitable employment. All India Council for Technical Education AICTE-SLA (PARAKH) project has been designed to measure the benchmark levels and gains in academic and higher-order thinking skills of students and faculties to understand the  various factors that affect skill development in Technical Institutes across India.\n", "Vision of AICTE - SLA (PARAKH) is to motivate bridging the gap between academics and industry by providing a platform for self-assessment of knowledge and 21st century skill capabilities in students and faculty members to ensure global competitiveness. AICTE - SLA (PARAKH) will enable policymakers and institutions to assess global competitiveness of students, faculty members and stakeholders to trigger necessary interventions creating a more effective system of education in the country. \n", "Read more about the institutional development schemes run by AICTE", "AICTE has decided to establish AICTE-IDEA (Idea Development, Evaluation & Application) Lab in AICTE approved institutions, encouraging students for application of science, technologies, engineering and mathematics (STEM) fundamentals towards enhanced hands-on experience, learning by doing and product visualisation.", "To energize and position students club/ Chapters/ Societies as facilitating entity for pursuit of individual interests, creative work, showcasing talent, networking and teamwork opportunities, social experience; organization and management skills, exposure to professional ethics etc.", "The scheme provides financial assistance to institutions for organizing Conference at National and International level in various fields of Technical Education. ", "The scheme equips technical institutions with infrastructural facilities, laboratories, workshops, and computing facilities to enhance teaching, training and research capabilities. The limit of funding is Rs 20 Lakhs and project duration is 2 years", "Free access to e-Journals/ e-Resources to AICTE approved Government/ Government-Aided technical institutes is facilitated through INFLIBNET, subscription of which is paid by AICTE.", "The scheme aims to support Government/ Government-aided engineering colleges/ University departments/Polytechnics for construction of girls/boys hostels for students /researchers belonging to SC&ST/ Differently\nabled/ NER students. Total funding is Rs 3.25 crore, which to be provided to institute to complete the project within the period of 3 years.", "To enhance the functional efficiency of the technical institutes located in far-flung areas of North East India, AICTE has launched a scheme for providing logistics support to the technical institutes of NER by extending financial assistance for construction of rain water harvesting system, alternative power support & availability/connection of internet facility ", "Senior academicians (serving or superannuated) shall be nominated as Margdarshak(MD) to act as individual mentors for guiding beneficiary institutes to achieve the NBA accreditation and enhance the quality of technical education.", "A well-established AICTE approved institute referred to as Margdarshan Institute or Mentor Institute (MI) is supported with an objective to mentor up to 10 nearby institutes in achieving the NBA accreditation.", "Learn about the schemes that promote research in technical education in India", "To provide research grant for young TEQIP faculties recruited in different TEQIP institutes so as to collaborate for research and build research community among TEQIP Faculty, Regular faculty of Project institutions (focus and non-focus) & Premier institutions of the country", "For any Technical Query, kindly contact 011-29581335 or email: crsteqip@aicte-india.org", "Learn about Schemes that promote co-ordinated development in India.", "AICTE is initiating “Kaushal Augmentation and Restructuring Mission of AICTE” (KARMA) for all AICTE approved institutions in the country to overcome the dual challenge of scarcity of skilled manpower in jobs and low skill level of those who are presently in jobs. ", "AICTE is implementing the PMKVY for Technical Institutes scheme through AICTE approved Technical Institutions in the country.Under this Scheme in next three years, 10.5 Lakh youth are to be given Engineering Skills. ", "Saansad Aadarsh Gram Yojana is a rural development programme broadly focusing upon the development in the villages which includes social development, cultural development and spread motivation among the people on social mobilization of the village community.", "ARIIA is an initiative of Ministry of Human Resource Development (MHRD), Govt. of India to systematically rank all major higher educational institutions and universities in India on indicators related to “Innovation and Entrepreneurship Development” amongst students and faculties.."], "education": ["Education or teaching in the broadest sense is any act or experience that has a formative effect on the mind, character or physical ability of an individual. In its technical sense,  education is the process by which society deliberately transmits its accumulated knowledge, skills and values from one generation to another.", "Teachers in educational institutions direct the education of students and might draw on many subjects, including reading, writing, mathematics, science and history. This process is sometimes called schooling when referring to the education of teaching only a certain subject, usually as professors at institutions of higher learning. There is also education in fields for those who want specific vocational skills, such as those required to be a pilot. In addition there is an array of education possible at the informal level, such as in museums and libraries, with the Internet and in life experience. Many non-traditional education options are now available and continue to evolve.", "", "The Right to Education has been established as a basic human right: since 1952, Article 2 of the first Protocol to the European Convention on Human Rights obliges all signatory parties to guarantee the right to education. At world level, the United Nations' International Covenant on Economic, Social and Cultural Rights of 1966 guarantees this right under its Article 13.India has passed the Right to Education Bill 2009 in August 2009", "The role of education in facilitating social\nand economic progress is well recognized. It opens up opportunities leading to both individual and group entitlements. ", "Engendering XI Five Year Plan (below to be added as description) \nA civil society initiative coordinated by National Alliance of Women (NAWO) with support from Ministry of Women and Child Development (MWCD), UN Development Program (UNDP) and UN Development Fund for Women (UNIFEM).  ", "A little more than half a century has passed since the government initiated a\nplanned development of higher education in the country with the establishment of\nUniversity Grants Commission in 1953. ", "Education or teaching in the broadest sense is any act or experience that has a formative effect on the mind, character or physical ability of an individual. In its technical sense education is the process by which society deliberately transmits its accumulated knowledge, skills and values from one generation to another.", " ", " click below links to read the relative content", "A finishing school is defined as \"a private school for students that emphasizes training in all round personality development, cultural and social activities. Specific skill sets may be imparted as value addition. The name reflects that it follows a school or college education and is intended to complete the educational experience. It may consist of an intensive course, or a one-year program.", "An individual's personality is an aggregate conglomeration of decisions we've made throughout our lives (Bradshaw). There are inherent natural, genetic, and environmental factors that contribute to the development of our personality. According to process of socialization, \"personality also colors our values, beliefs, and expectations ... Hereditary factors that contribute to personality development do so as a result of interactions with the particular social environment in which people live.\" ", "There are several personality types as Katharine Cook Briggs and Isabel Briggs Myers illustrated in several personalities typology tests. These tests only provide enlightenment based on the preliminary insight scored according to the answers judged by the parameters of the test. Other theories on personality development are Jean Piaget stages of development, and personality development in Sigmund Freud's theory being formed through the interaction of id, ego, and super-ego.", "", "A skill is the learned capacity to carry out pre-determined results often with the minimum outlay of time, energy, or both. Skills can often be divided into domain-general and domain-specific skills. For example, in the domain of work, some general skills would include time management, teamwork and leadership, self motivation and others, whereas domain-specific skills would be useful only for a certain job. Skill usually requires certain environmental stimuli and situations to assess the level of skill being shown and used.", "People need a broad range of skills in order to contribute to a modern economy and take their place in the technological society of the twenty-first century. The American Society for Training & Development (ASTD), a non-profit association for workplace learning and performance professionals study showed that through technology, the workplace is changing, and so are the skills that employees must have to be able to change with it. The study identified 16 basic skills that the workplace of the future would need in the employee of the future.", "", "The skills involved can be defined by the organization concerned, or by third party institutions. They are usually defined in terms of a skills framework, also known as a competency framework or skills matrix. This consists of a list of skills, and a grading system, with a definition of what it means to be at particular level for a given skill. To be most useful, skills management needs to be conducted as an ongoing process, with individuals assessing and updating their recorded skill sets regularly. These updates should occur at least as frequently as employees' regular line manager reviews, and certainly when their skill sets have changed.", "Morality (from the Latin moralities \"manner, character, proper behavior\") is a system of conduct and ethics that is virtuous. Morality has three principal meanings.", " In its \"descriptive\" sense, morality refers to personal or cultural values, codes of conduct or social mores that distinguish between right and wrong in the human society. Describing morality in this way is not making a claim about what is objectively right or wrong, but only referring to what is considered right or wrong by people. For the most part right and wrong acts are classified as such because they are thought to cause benefit or harm, but it is possible that many moral beliefs are based on prejudice, ignorance or even hatred. This sense of term is also addressed by descriptive ethics.", " In its \"normative\" sense, morality refers directly to what is right and wrong, regardless of what people think. It could be defined as the conduct of the ideal \"moral\" person in a certain situation. This usage of the term is characterized by \"definitive\" statements such as \"That act is immoral\" rather than descriptive ones such as \"Many believe that act is immoral.\" It is often challenged by a moral skepticism, in which the unchanging existence of a rigid, universal, objective moral \"truth\" is rejected, and supported by moral realism, in which the existence of this \"truth\" is accepted. The normative usage of the term \"morality\" is also addressed by normative ethics.", "", " Morality may also be defined as synonymous with ethics, the field that encompasses the above two meanings and others within a systematic philosophical study of the moral domain. Ethics seeks to address questions such as how a moral outcome can be achieved in a specific situation (applied ethics), how moral values should be determined (normative ethics), what morals people actually abide by (descriptive ethics), what the fundamental nature of ethics or morality is, including whether it has any objective justification (meta-ethics), and how moral capacity or moral agency develops and what its nature is (moral psychology). ", " A key issue is the meaning of the terms \"moral\" or \"immoral\". Moral realism would hold that there are true moral statements which report objective moral facts, whereas moral anti-realism would hold that morality is derived from any one of the norms prevalent in society (cultural relativism); the edicts of a god (divine command theory); is merely an expression of the speakers' sentiments (emotivism); an implied imperative (universal prescriptivism); or falsely presupposes that there are objective moral facts (error theory). Some thinkers hold that there is no correct definition of right behavior, that morality can only be judged with respect to particular situations, within the standards of particular belief systems and socio-historical contexts. This position, known as moral relativism, often cites empirical evidence from anthropology as evidence to support its claims. The opposite view, that there are universal, eternal moral truths are known as moral universalism. Moral universalists might concede that forces of social conformity significantly shape moral decisions, but deny that cultural norms and customs define morally right behavior.", "Vocational education or Vocational Education and Training (VET), also called Career and Technical Education (CTE), prepares learners for jobs that are based in manual or practical activities, traditionally non-academic and totally related to a specific trade, occupation or vocation, hence the term, in which the learner participates. It is sometimes referred to as technical education, as the learner directly develops expertise in a particular group of techniques or technology.", "Generally, vocation and career are used interchangeably. Vocational education might be classified as teaching procedural knowledge. This may be contrasted with declarative knowledge, as used in education in a usually broader scientific field, which might concentrate on theory and abstract conceptual knowledge, characteristic of tertiary education.", "Vocational education can be at the secondary or post-secondary level and can interact with the apprenticeship system. Increasingly, vocational education can be recognised in terms of recognition of prior learning and partial academic credit towards tertiary education (e.g., at a university) as credit; however, it is rarely considered in its own form to fall under the traditional definition of a higher education.", "Up until the end of the twentieth century, vocational education focused on specific trades such as for example, an automobile mechanic or welder, and was therefore associated with the activities of lower social classes. As a consequence, it attracted a level of stigma. Vocational education is related to the age-old apprenticeship system of learning.", "However, as the labor market becomes more specialized and economies demand higher levels of skill, governments and businesses are increasingly investing in the future of vocational education through publicly funded training organizations and subsidized apprenticeship or traineeship initiatives for businesses. At the post-secondary level vocational education is typically provided by an institute of technology, or by a local community college.", "", "India is a vast country with a population of more than 1.2 billion. 75% of India’s population lives in about six lac villages. There is a visible difference in rural and urban, rich and poor, highly educated and lesser educated, forward and backward areas.", "While resourceful people, particularly those living in urban areas, have had access to better education and professional training, but vast majority of those who live in rural areas and slums are lesser educated and hardly undergo any technical, professional and vocational training. In fact, for most of such people, quality education and higher technical and professional education is unaffordable.", "In terms of career options, such lesser educated and not so fortunate people tend to work in low paid unorganized sector. Per person productivity of such persons works out to be a small fraction of productivity of those who work in organized sector of Indian economy. In an increasingly competitive economic environment of our country, the unorganized sector, which is so important for the country, needs to increase the productivity of its manpower for its survival and growth.", "Yet another paradox before the Indian informal sector is that it can not afford employing highly educated and professionally trained manpower which usually aspires for highly challenging, rewarding and satisfying career. The only option available before the Indian informal sector is to depend upon relatively low paid manpower trained through nonformal system of skill development.", "There is, therefore, an urgent need to train millions of persons every year through a countrywide network of non-formal skill development. Such non-formal skill training should attract beneficiaries from all cross-sections of Indian society.", "", "There are more than 3200 polytechnics and equivalent technical institutions which exhibit potential to provide skill training to millions of youth through their own facilities and or by establishing extension centres in collaboration with ITIs, or Vocational Skill Knowledge providers, NGOs. These polytechnics can also render useful services in adoption of appropriate technologies and providing technical and support services to rural people and slum dwellers.", "Distance Education, or distance learning, is a field of education that focuses on the pedagogy and andragogy, technology, and instructional systems design that aims to deliver education to students who are not physically \"on site\".", "Distance Education “is a process to create and provide access to learning when the source of information and the learners are separated by time and distance, or both.” In other words, distance learning is the process of creating an educational experience of equal qualitative value for the learner to best suit their needs outside the classroom.", "Distance education courses that require a physical on-site presence for any reason including the taking of examinations is considered to be a hybR&D or blended course of study. ", "This emerging technology is becoming widely used in universities and institutions around the globe. With the recent trend of technological advance, distance learning is becoming more recognized for its potential in providing individualized attention and communication with students internationally.", "Click the link below", "For India to emerge as a knowledge super power of the world in the shortest possible time it is imperative to convert our demographic advantage into knowledge powerhouse by nurturing and honing our working population into knowledge or knowledge enabled working population. Human Resource Development would certainly be the key for it to happen.", "The content portion of this Mission would have an ambitious vision of catering to the learning needs of more than 50 crore Indians (working population) and of providing a one stop solution to all the requirements of the learning community. In order to bolster our knowledge resources, to obtain and maintain the competitive edge in the world, we require a system of identification and nurturing of talent and lifelong learning.", "Knowledge modules based on the personalized needs of the learner would need to be delivered to him /her at the right time with the right content interactively to take care of his / her aspirations. In due course of time there would be a need to develop and maintain the knowledge and capability profile of every individual learner / worker. Such a system would have to be developed in a cost effective manner over a period of time, integrating, inter-alia the following objectives:", "Apex Level Bodies are responsible for recognition of courses, promotion of professional institutions and providing grants to different ​programmes and various awards.", "Read more about the various state level Board of Technical Education", "Learn more about the Indian Institutes of Information Technology, a group of institutes of higher education in India, focused on information technology.", "The Indian Institutes of Management (IIMs), a group of autonomous institutes of management education and research in India.", "The Indian Institutes of Technology (IITs), the autonomous public institutes of higher education located in India", "National Institute of Pharmaceutical Education and Research (NIPER) are the national level institutes in pharmaceutical sciences with a proclaimed objective of becoming a centre of excellence for advanced studies and research in pharmaceutical sciences.", "The National Institutes of Technology (NITs), are esteemed colleges of engineering and technology education in India. They were originally called Regional Engineering Colleges (RECs). In 2002, the Ministry of Human Resource Development, Government of India, decided to upgrade, in ", "National Institutes of Technical Teachers' Training & Research (NITTTR), were established in the Country as Technical Teachers' Training Institute (TTTI),  The first among four such institutes was established in Kolkata (1965), (other three being at Chandigarh, Bhopal & Chennai),", "The Research Councils of India are established and made responsible for cutting edge Research & Development activities / knowledge base in diverse areas or fields.  ", "Learn more about various Central, State, Open Private universities, Autonomous Institutions,Institutes of National Importance (MHRD)  and more", "Information and Communication Technology or ICTs allow users to participate in a rapidly changing world in which work and other activities are increasingly transformed by access to varied and developing technologies.\nThe Indian Information Technology and industry accounts for a 5.9% of the country's GDP and export earnings as of 2009, while providing employment to a significant number of its tertiary sector workforce. More than 2.3 million people are employed in the sector either directly or indirectly, making it one of the biggest job creators in India and a mainstay of the national economy.", "ICT tools can be used to find, explore, analyze, exchange and present information responsibly and without discrimination. ICT can be employed to give users quick access to ideas and experiences from a wide range of people, communities and cultures.", "", "Realising the importance of Information and Communication Technology (ICT) the Ministry of Human Resource Development as per the Mission Document, ICT is the tool in education available to enhance the current enrolment rate in Higher Education, at present 15 percent to 30 percent by the end of the 11th Plan period.", "The Ministry also launched a web portal named “SAKSHAT” a ‘One Stop Education Portal’. The high quality e-content once developed will be uploaded on SAKSHAT in all disciplines and subjects. Several projects are in the completion stage and are expected to change the way teaching and learning is done in India.", "The case in point is the project, “Developing suitable pedagogical methods for various classes, intellectual calibres and research in e-learning,” anchored by IIT Kharagpur. Faculties from all the IITs and several NITs are participating in this curriculum development project.", "The National Mission on Education through Information and Communication Technology (ICT) has, under its aegis, created Virtual Labs, Open Source and Access Tools, Virtual Conference Tools, Talk to Teacher programs, a Non-Invasive Blood Glucometer and also for simulated lab experiments, a Di. Electric frequency shift application development of resonator for low cost oscillators.", "The National Mission on Education through Information and Communication Technology (ICT) has been envisaged as a Centrally Sponsored Scheme to leverage the potential of ICT, in providing high quality personalized and interactive knowledge modules over the internet/intranet for all the learners in Higher Education Institutions in any time any where mode. This is expected to be a major intervention in enhancing the Gross Enrolment Ratio (GER) in Higher Education by 5 percentage points during the XI Five Year Plan period and in ensuring access and equity in Higher Education.", "The Mission has two major components viz., (a) content generation and (b) connectivity along with provision for access devices for institutions and learners. It seeks to bR&Dge the digital divide, i.e., the gap in the skills to use computing devices for the purpose of teaching and learning among urban and rural teachers/learners in Higher Education domain and empower those, who have hitherto remained untouched by the digital revolution and have not been able to join the mainstream of the knowledge economy. It plans to focus on appropriate pedagogy for e-learning, providing facility of performing experiments through virtual laboratories, on-line testing and certification, on-line availability of teachers to guide and mentor learners, utilization of available Education Satellite (EduSAT) and Direct to Home (DTH) platforms, training and empowerment of teachers to effectively use the new method of teaching learning etc.", "On the one hand, the Mission would create high quality e-content for the target groups and on the other, it would simultaneously seek to extend computer infrastructure and connectivity to over 18000 colleges in the country including each of the departments of nearly 400 universities/deemed universities and institutions of national importance. The peer group assisted content development would utilise the Wikipedia type of collaborative platform under the supervision of a content advisory committee responsible for vetting the content. Interactivity and problem solving approach would be addressed through “Talk to a Teacher” segment.", "", "The Indian Information Technology and industry accounts for a 5.9% of the country's GDP and export earnings as of 2009, while providing employment to a significant number of its tertiary sector workforce. More than 2.3 million people are employed in the sector either directly or indirectly, making it one of the biggest job creators in India and a mainstay of the national economy.", "In March 2009, annual revenues from outsourcing operations in India amounted to US$60 billion and this is expected to increase to US$225 billion by 2020. The most prominent IT hub is IT capital Bangalore. The other emerging destinations are Chennai, Hyderabad, Pune, NCR and Kolkata. Technically proficient immigrants from India sought jobs in the western world from the 1950s onwards as India's education system produced more engineers than its industry could absorb. India's growing stature in the information age enabled it to form close ties with both the United States of America and the European Union.", "", "Each year India produces roughly 800,000 engineers in the country, out of them 25% to 30% possess both technical competency and English language skills, although 10% of India's population can speak in English. India has developed a number of outsourcing companies specializing in customer support via Internet or telephone connections.", "By 2009, India also has a total of 37,160,000 telephone lines in use, a total of 506,040,000 mobile phone connections, a total of 81,000,000 Internet users—comprising 7.0% of the country's population, and 7,570,000 people in the country have access to broadband Internet— making it the 12th largest country in the world in terms of broadband Internet users. Total fixed-line and wireless subscribers reached 543.20 million as of November, 2009.", "The Indian telecommunication industry, with about 525 million mobile phone connections (Dec 2009), is the third largest telecommunication network in the world and the second largest in terms of number of wireless connections. The Indian telecom industry is one of the fastest growing in the world and is projected that India will have 'billion plus' mobile users by 2015. Projection by several leading global consultancies is that India’s telecom network will overtake China’s in the next 10 years. For the past decade or so, telecommunication activities have gained momentum in India. Efforts have been made from both governmental and non-governmental platforms to enhance the infrastructure. The idea is to help modern telecommunication technologies to serve all segments of India’s culturally diverse society, and to transform it into a country of technologically enabled people.", "Know more about the syllabus in detail", "Note: Click below the links to read the relative content.", "Note: Click below the links to read the relative content.", "Note: Click below the links to read the relative content.", "Note: Click below the links to read the relative content.", "Note: Click below the links to read the relative content.", "Note: Click below the links to read the relative content.", "Note: Click below the links to read the relative content.", "Note: Click below the links to read the related content.", "Note: Click below the links to read the related content.", " Read more about the library services ", "Click below the links to read the relative content.", "Click below the links to read the relative content."], "opportunities": ["General Guidelines Applicable to all Faculty Development Schemes of AICTE.", "In order to train the Inductee Teachers in AICTE approved / recognised institutions, National Initiative for Technical Teachers Training (for Inductee Teachers) has been launched. It imparts training to the Inductee Teachers in three phases. The first phase of the training programme for the Inductee Teachers shall be conducted in Massive Open Online Courses (MOOCs) mode for eight modules on the SWAYAM platform through the NITTT portal www.nittt.ac.in followed by one-month industrial internship (second phase) and then mentor based training (third phase).", "This scheme is aimed to recognize the meritorious faculties on Teachers Day i.e. 5th September every year at National level and encourage them to update themselves to the ever changing needs of higher education at global level and thereby becoming an effective contributor towards the society.", "The main objective of the programme is to upgrade the qualification of the faculty members of the degree level institutions in the country. Scholarship @Rs. 15000/-PM and Rs. 5000/ PM are given to Ph.D/ M.Tech. Scholars. Total 106 QIP centers are in the country. ", "This scheme Promotes Research in identified thrust areas of in Technical Education. RPS is aimed to create research ambience in the institutes by promoting research in engineering sciences and innovations in established and newer technologies; and to generate Master’s and Doctoral degree candidates to augment the quality of faculty and research. The limit of funding is Rs 25 Lakh for project duration of 3 years.", " Scheme provides scholarships to the faculty who fulfils eligibility criteria and obtains admission in the Doctoral Degree programme leading to award of PhD degree in any of the enlisted top 500 universities/institutes (based on the QS ranking, the Times ranking and the Shanghai ranking) in the world.", "The scheme is intended to Institutions   for   induction training to   teachers employed in AICTE approved Technical Institutions to facilitate up-gradation of knowledge and skill. Rs 5-7 Lakh are granted for the 2 weeks FDP.", "Short Term Training Program (STTP) intends to conduct faculty trainings through financial assistance from AICTE to enable faculty members in the field of technical education to introspect and learn techniques that can help prepare students for active and successful participants in a knowledge society. ", "To Develop the skill of the participants to involve the masses in traditional sports/games and fun games for physical activity through recreation.", "The objective of the AICTE – University training programs is to conduct training for faculty members to prepare them for being successful in a knowledge society.", "The objective, of AICTE – Technical University Training program for Librarians, is to conduct training for Librarians to prepare them for being successful and affective in a knowledge society. \nIt provide a dynamic and quality user centered library and information services that enhance teaching, learning and research while inculcating life-long learning skills and fostering human development.\n", "The scheme enables meritorious faculty to interact at International Level Conferences, both within and outside India, Seminars, and Symposia.", "Scheme provides fellowship to Engineering Teachers for Doctoral Research in Central Laboratories in order to promote a research culture amongst the faculty in AICTE approved engineering institutions. Limit of funding is Rs. 5.7 lakh per scholar for three year.", "AICTE and INAE distinguished visiting Professor scheme envisages promotion of industry-institute interaction.", "The objective is to conduct AICTE-ISTE Induction/ Refresher Programmes for the teaching faculty working in technical institutions. Total 100 Refresher programme & 50 Orientation programme with the funding of Rs. 300000 per programme.", "To promote use of 'Scheduled Regional Language' in Technical Education for creating knowledge base in local language and to encourage creation of treasure of latest technical knowledge incorporating the newest developments by grant of financial support to the distinguished faculty/writers/translators.", "The Emeritus Professor (Distinguished Practicing Engineer) Fellowship intends to utilize the expertise of\nhighly qualified and experienced superannuated Engineers who have made undoubtable,\nunchallengeable, unparalleled and exceptional contribution to the society in their respective fields in\nany discipline in engineering for the benefit of students/faculty of host institutes & of institutes located\nin the adjoining areas.", "The word student is etymologically derived through Middle English from the Latin second-type conjugation verb studēre, meaning \"to direct one's zeal at\"; hence a student could be described as \"one who directs zeal at a subject\". In its widest use, student is used for anyone who is learning.", "Learning is acquiring new knowledge, behaviors, skills, values or preferences. It may involve processing different types of information. Learning functions can be performed by different brain learning processes, which depend on the mental capacities of learning subject/agent, the type of knowledge which has to be acquitted, as well as on socio-cognitive and environmental circumstances.", "Human learning may occur as part of education or personal development. It may be goal-oriented and may be aided by motivation. The study of how learning occurs is part of neuropsychology, educational psychology, learning theory, and pedagogy.", "Learning may occur as a result of habituation or classical conditioning, seen in many animal species, or as a result of more complex activities such as play, seen only in relatively intelligent animals and humans. Learning may occur consciously or without conscious awareness. There is evidence for human behavioral learning prenatally, in which habituation has been observed as early as 32 weeks into gestation, indicating that the central nervous system is sufficiently developed and primed for learning and memory to occur very early on in development.", "Find out how creativity can drive business results. ", "A one stop shop to know more about your college. ", "A one stop shop to grow your knowledge. ", "An Opportunity to enhance your Practice. ", "Ministry of Electronics and Information Technology (MeitY), Government of India has established a Centre of Excellence (CoE) for Products Based on Li-ion Cells (Post-Cell) along with the Government of Uttar Pradesh at CDAC Noida in association with India Cellular & Electronics Association (ICEA) for promoting design and development of products used as Mobile handset accessories and other electronic applications. The CoE will serve as a one-stop facility/centre for R&D, design & development of products based on Li-ion Cells (Post-Cell). ", "The National Apprenticeship Training Scheme in India is a one year programme equipping technically qualified youth with practical knowledge and skills required in their field of work. ", "The FOSSEE team at IIT Bombay has started the registrations for the Summer Fellowship to hire interns ", "ALTTC (Advanced Telecom Training Centre), Ghaziabad, an Apex Training Centre of BSNL under Ministry of Communication, Govt. of India has started conducting online Live and INTERACTIVE Vocational Training for students to Bridge the gap between Industry and Academia at ALTTC, BSNL, Ghaziabad. ALTTC, BSNL, Ghaziabad is also centre of Excellence of ITU (Geneva) in the priority areas of wireless and Fixed Broadband, IoT and Cyber Security.", "India is my country and all Indians are my brothers and sisters. I love my country and I am proud of its rich and varied heritage. I shall always strive to be worthy of it.", "I shall give respect to my parents, teachers and elders  and treat everyone with courtesy.", "To my country and my people, I pledge my devotion. In their well being and prosperity alone, lies my happiness.", "India is my country and all Indians are my brothers and sisters. I love my country and I am proud of its rich and varied heritage. I shall always strive to be worthy of it.", "I shall give respect to my parents, teachers and elders  and treat everyone with courtesy.", "To my country and my people, I pledge my devotion. In their well being and prosperity alone, lies my happiness.", "You can have professional ethics, but you seldom hear about professional morals. Ethics tend to be codified into a formal system or set of rules which are explicitly adopted by a group of people. Thus you have medical ethics. Ethics are thus internally defined and adopted, whilst morals tend to be externally imposed on other people.", "Values are the rules by which we make decisions about right and wrong, should and shouldn't, good and bad. They also tell us which are more or less important, which is useful when we have to trade off meeting one value over another.", "Morals have a greater social element to values and tend to have a very broad acceptance. Morals are far more about good and bad than other values. We thus judge others more strongly on morals than values. A person can be described as immoral, yet there is no word for them not following values.", "You can have professional ethics, but you seldom hear about professional morals. Ethics tend to be codified into a formal system or set of rules which are explicitly adopted by a group of people. Thus you have medical ethics. Ethics are thus internally defined and adopted, whilst morals tend to be externally imposed on other people.", "If you accuse someone of being unethical, it is equivalent of calling them unprofessional and may well be taken as a significant insult and perceived more personally than if you called them immoral (which of course they may also not like).", "Read more about the institutional development schemes run by AICTE", "AICTE has decided to establish AICTE-IDEA (Idea Development, Evaluation & Application) Lab in AICTE approved institutions, encouraging students for application of science, technologies, engineering and mathematics (STEM) fundamentals towards enhanced hands-on experience, learning by doing and product visualisation.", "To energize and position students club/ Chapters/ Societies as facilitating entity for pursuit of individual interests, creative work, showcasing talent, networking and teamwork opportunities, social experience; organization and management skills, exposure to professional ethics etc.", "The scheme provides financial assistance to institutions for organizing Conference at National and International level in various fields of Technical Education. ", "The scheme equips technical institutions with infrastructural facilities, laboratories, workshops, and computing facilities to enhance teaching, training and research capabilities. The limit of funding is Rs 20 Lakhs and project duration is 2 years", "Free access to e-Journals/ e-Resources to AICTE approved Government/ Government-Aided technical institutes is facilitated through INFLIBNET, subscription of which is paid by AICTE.", "The scheme aims to support Government/ Government-aided engineering colleges/ University departments/Polytechnics for construction of girls/boys hostels for students /researchers belonging to SC&ST/ Differently\nabled/ NER students. Total funding is Rs 3.25 crore, which to be provided to institute to complete the project within the period of 3 years.", "To enhance the functional efficiency of the technical institutes located in far-flung areas of North East India, AICTE has launched a scheme for providing logistics support to the technical institutes of NER by extending financial assistance for construction of rain water harvesting system, alternative power support & availability/connection of internet facility ", "Senior academicians (serving or superannuated) shall be nominated as Margdarshak(MD) to act as individual mentors for guiding beneficiary institutes to achieve the NBA accreditation and enhance the quality of technical education.", "A well-established AICTE approved institute referred to as Margdarshan Institute or Mentor Institute (MI) is supported with an objective to mentor up to 10 nearby institutes in achieving the NBA accreditation."]}